/*
 *  우리가 사용할 수 있는 블럭은 2x1, 2x2, 1x2입니다.
 *  따라서 1칸 전의 dp값과 2칸 전의 dp값을 이용하여 점화식을 세웠습니다.
 *  점화식은 a_n = a_(n-1) + 2 * a_(n-2)이고 a_1과 a_2를 초기화해줬습니다.
 *  2칸 전의 데이터에 2를 곱해준 이유는
 *  2칸을 채우기 위해서는 2x2 1개 혹은 1x2 2개로 2가지 방법이 있기 때문입니다.
 */

#include<iostream>

using namespace std;

int main(void){
    int dp[1001]={0};
    int n;
    cin>>n;
    dp[1]=1;
    dp[2]=3;
    // 계단을 뛰는 것과 비슷한 문제이다.
    // 1칸 이전, 2칸 이전의 경우의 수를 더해주면 된다.
    // 주의해야할 점은 2칸 전의 데이터에 2를 곱한 뒤 더해줘야한다는 것!
    for(int i=3;i<=n;i++){
        dp[i]=((dp[i-2]*2)+dp[i-1])%10007;
    }
    cout<<dp[n]<<endl;
}
